app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "dada"], ["last_name", "k"], ["updated_at", "2021-06-09 02:18:16.166020"], ["id", 1]]
---
    def update
      @student = Student.find(params[:id])
      @student = Student.update(student_params(:first_name, :last_name))